# -*- coding: utf-8 -*-
import random




class cheatcode:
    def __init__(self):
        self.db = {u'food':      {u'گشنمه', u'گرسنمه', u'غذا', u'غذای ایرانی', u'غذا ی ایرانی'},
                   u'wiki_en':   {u'w', u'wiki', u'wiki_en'},
                   u'joke':      {u'joke', u'جک', u'جوک'}}
    def find(self, word):
        for cheat_cat in self.db:
            if word in self.db[cheat_cat]:
                return cheat_cat
        return None
    
class reserved_code:
    def __init__(self):
        self.db = {u'/start':           u'سلام میتونی من رو امتحان کنی. واسه شروع یه کلمه واسم بفرست تا خیلی کوتاه درموردش واست توضیح بدم :)',
                   u'/help':            u'سلام میتونی من رو امتحان کنی. واسه شروع یه کلمه واسم بفرست تا خیلی کوتاه درموردش واست توضیح بدم :)',
                   
                   u'a4fr':             u'علی نجفی بابای این ربات :))',
                   u'علی نجفی':         u'علی نجفی بابای این ربات :))',
                   u'ali najafi':       u'علی نجفی بابای این ربات :))',
                   u'سلام':             u'سلام :)',
                   u'کمک':              u'سلام میتونی من رو امتحان کنی. واسه شروع یه کلمه واسم بفرست تا خیلی کوتاه درموردش واست توضیح بدم :)',
                   u'ممنون':            u'خواهش میکنم :)',
                   u'خوبی':            u'ممنون :)',
                   u'خوبی؟':            u'ممنون :)',
                   u'خوبی ؟':         u'ممنون :)',
                   u'خوبی؟؟':        u'ممنون :)',
                   u'خوبی ؟؟':        u'ممنون :)',
                   u'خدافظ':         u'خدا نگهدار :)',
                   u'خدا فظ':         u'خدا نگهدار :)',
                   u'خداحافظ':      u'خدا نگهدار :)',
                   u'خدا حافظ':     u'خدا نگهدار :)',
                   u'تشنمه':     u'اگر در حال تشنگی چیزی برای نوشیدن نداشته باشیم، تشنگی چنان بر ما فشار می‌آورد که جز آن به هیچ چیز دیگر نمی اندیشیم. همهٔ ما روزی طعم تشنگی را چشیده ایم، ولی سرانجام خوشیختانه آبی پیدا کرده و خود را از چنگ آن رها ساخته ایم. هر گاه انسانی چند روز پی در پی تشنه بماند بیشک جان خود را از دست خواهد داد.بدن به ذخیرهٔ آب بسیار نیازمند است.',
                   u'آب':          u'اگر در حال تشنگی چیزی برای نوشیدن نداشته باشیم، تشنگی چنان بر ما فشار می‌آورد که جز آن به هیچ چیز دیگر نمی اندیشیم. همهٔ ما روزی طعم تشنگی را چشیده ایم، ولی سرانجام خوشیختانه آبی پیدا کرده و خود را از چنگ آن رها ساخته ایم. هر گاه انسانی چند روز پی در پی تشنه بماند بیشک جان خود را از دست خواهد داد.بدن به ذخیرهٔ آب بسیار نیازمند است.',
                   }
    def find(self, word):
        if word in self.db:
            return self.db[word]
        return None

class blacklist:
    def __init__(self):
        self.db = {u'گوزو'}
    def find(self, word):
        if word in self.db:
            return word
        return None
      
class iranian_foods:
    def __init__(self):
        self.db = [u"آلبالوپلو", u"باقلاپلو", u"پتله پلو", u"ته‌چین", u"دمپختک", u"رشته‌پلو", u"زرشک‌پلو", u"سبزی‌پلو", u"شویدباقلا", u"شیرین‌پلو", u"عدس‌پلو", u"قیمه‌نثار", u"کته", u"کلم‌پلو", u"دمپختک باقلا", u"لوبیاپلو", u"مرصع‌پلو", u"نخودپلو", u"هویج‌پلو", u"والک‌پلو", u"دال عدس", u"فسنجان", u"قلیه‌ماهی", u"قورمه‌سبزی", u"قیمه", u"خورش بادمجان", u"قیمه بادمجان", u"قیمه‌نثار", u"خورش کدوبادمجان", u"خورش کرفس", u"خورش کنگر", u"مرغ ترش", u"کباب بختیاری", u"کباب برگ", u"نان و کباب", u"بناب‌کباب", u"کباب تابه‌ای", u"جوجه‌کباب", u"کباب چنجه", u"شیشلیک", u"کباب کوبیده", u"شامی کباب", u"آب‌گوشت", u"آب‌دوغ خیار", u"اشکنه", u"چغور پغور", u"دیزی", u"سیرابی شیردان", u"کله‌پاچه", u"شامی", u"شله مشهدی", u"شیربرنج", u"تاس‌کباب", u"آب پیازک", u"باسترما", u"باقلاقاتوق", u"ترخینه", u"دلمه", u"حلیم بادمجان", u"حلیم بوقلمون", u"دوپیازه آلو", u"سمبوسه", u"فلافل", u"کاچی", u"کله‌جوش", u"کتلت", u"کشک بادمجان", u"کوکو", u"گیپا", u"لونگی", u"میرزاقاسمی", u"نازخاتون", u"نرگسی", u"ماهی فویج", u"اناربیج", u"کولی غورابیج", u"سیر قلیه", u"گل در چمن", u"کال کباب", u"اناربیج", u"مرغ لاکو", u"سیرابیج", u"لونگی", u"کولی غورابیج", u"واویشکا", u"شامی", u"آش سبزی", u"آش ماست", u"آش دوغ", u"آب پیازک", u"پاچه پلو", u"قنبرپلو", u"دوپیازه", u"یخنی نخود", u"رب پلو", u"کلم پلو", u"بادام سوخته", u"یخنی عدس کلم", u"کوفته هلو", u"کوفته سبزی", u"شکر پلو", u""]

    def suggest(self):
        rand = random.randint(1, len(self.db)-1)
        return  self.db[rand]
    
    
class joke:
    def __init__(self):
        self.db = [u"انقدر هوا گرمه\nدیدم یه مگس با یه پرچم سفید چسبیده به پنجره\nروش نوشته\nدرو باز کن بی انصاف\nناموسن اذیتت نمیکنم\nفقط میخوام خنک شم :))", u"خدایا جوانانی را که\nبا پدر و مادرشون قهر می کنن\nبه راهی جز خوانندگی هدایت بفرم :))", u"تو مغازه رفته بودم چیزی بخرم\nیهو دختره اومد گفت ببخشید اقا سلام خدافظ دارین؟0_0\nهمه این شکلی شدن 0_o\nیهو دختره گفت ای بابا چرا هیشکی نمیفهمه من چی میگم ؟\nهای بای منظورمه دیگه …\nمیگن افق شلوغه\nمن برم شفق محو شم !", u"محصول جدید صحت\nشامپو سیب زمینی\nمخصوص موهای بی تفاوت :))", u"پیرمرده دم‌ عابر کارتشو‌ داده به من\nمیگه موجودی بگیر برام\nبراش گرفتم ، میگم ۵ هزار تومنه پدر جان\nگفت خاک بر اون سرت کنن با این موجودی گرفتنت و رفت :/", u"هیچ وقت کار امروز رو به فردا ننداز…\nفردا یه عالمه کار داری،\nقشنگ بندازش واسه دو سه هفته دیگه\nکه خیالــــــــــــــتم راحت باشه :))", u"به مامانم میگم چرا تو خونه همش دمپایی پات میکنی ؟\nمیگه: یه کابوی هیچوقت از اسلحه اش دور نمیمونه…\nمنم قانع شدم ، چون مسلح بود!!!", u"سلامتى همه سیکس پکاى اینستا\nکه هیچکدومشون سر ندارن! :))", u"تو خارج فقط اسکلا میزن مدرسه\n.\nواسه همین به مدرسه میگن school :))", u"الان یه پشه رو دیوار خوابیده\nمیخوام برم تو گوشش ویزز ویز کنم\nمن رفتم :))", u"بدترین شکستمو وقتی خوردم که…\nبا عشق و امید گره هندزفریمو باز کردم ولی…\nدیدم گوشیم شارژ نداره…\nهنوز کمر راست نکردم!!! ", u"بهترین و امیدوار کننده ترین\nچراغای زندگیم\nچراغای مودممه\nنباشن دق میکنم :))", u"دقت کردین به بعضیا که دست میدی انگار داری ماهی مرده رو تکون میدی ؟\nخو نمیخوای دست نده :/", u"یارو به جای عکس پروفایلش نوشته\ncoming soon ...\nاحتمالا تو این مدت میخواد فتوشاپ یاد بگیره", u"تو دانشگاه ما هر موقع چمنارو میزدن فرداش قرمه سبزی داشتیم!!!\nعایا این دوتا به هم ربط دارن؟؟؟", u"دختـر باس وختـى آقاش میگه لباسامـو اتـو کـن ؛ بگه :\nشلـوار لـى که اتـو نمیخـواد |:\nپاییـن پیرهنتـم که میره تو شلـوار |:\nآستینتـو هـم که میـدى بالا |:\nجلوشـم که صافـه |:\nیقتـ هـم که بازه |:\nپشتشـم که الان میرى تو ماشیـن لـم میدى به صندلـى صافـ میشه |:\nبقیشـو بده اتـو کنـم سایـه ســر !", u"دختر همسایمون اسمش طلاست\nتو نقره فروشی کار می کنه\nتازگیام رفته برنزه کرده…!!!\nفک کنم آخرش با مسی ازدواج کنه\nبچشم شکل استیلی بشه :))", u"دلیل اینکه من دکتر نشدم\n\nاینه که من از سبزی پلو خوشم نمیاد\nمیدونم ربطی نداره، ولی دلیل من اینه . . .\nبا منم بحث نکنید !!", u"میگن سود آورترین شغل در آمریکا دندون پزشکی هست\nاز بس ما مشت محکم بر دهان آمریکا میزنیم\nبیچاره ها دندون سالم ندارن خب", u"ﺍﻻﻥ ﺍﺧﺒﺎﺭ ﺍﻋﻼﻡ ﮐﺮﺩ ﺳﺎﻻﻧﻪ 800 ﻧﻔﺮ ﺩﺭ ﮐﺸﻮﺭﻣﺎﻥ\nﺩﺭ ﺍﺛﺮ ﮔﺎﺯ ﮔﺮﻓﺘﮕﯽ ﻣﯿﻤﯿﺮﻥ\nﺧﻮﺍﻫﺸﺎ ﮔﺎﺯ ﻧﮕﯿﺮﯾﻦ\nﺑﻮﺱ ﮐﻨﯿﺪ\nﻣﮕﻪ ﻫﺎﺭﯾﻦ", u"” خـــــــر نشو الاغ ”\nاوج نصحیت پسرا", u"پسرخالم رفته دستشویی ، آواز میخونه :\nحالا یارم بیاااا\nادرارم بیاااااا\nینی با این حرکتش موسیقی رو برد زیر سوال", u"اگه مامانم نصف راهکارهایی که موقع دیدن سریال\nبه هنرپیشه اول سریال نشون میده ، به من گفته بود\nالان کل مشکلات زندگیم حل شده بود !\nبه جون خودم . . .", u"هرکس به طریقی دل ما میشکند…\nخداروشکر تنوع بالاست\nحوصلمون سرنمیره", u"یه مرحله ای بالاتر از روشنفکری هست!…\n اونم اینه که کتاب نخری تا درخت های کمتری قطع بشن!", u"تو آفریقا یه قبیله اى هست نمیدونن طلاق چیه !!!\n\n\nاصن به این قرتى بازیا اعتقاد ندارن ...\nزن که پررو میشه میخورنش !!!", u"عرق نعنا\nاز خانواده همون عرق هاست..!!!\nولی اونا رفتن پی رفیق بازی\nاین نشست پای درس و مشقش\nمتخصص معده شده :))", u"ﺑﺰﺭﮔﺘﺮﯾﻦ ﺑُﺮﺩﯼ ﮐﻪ ﺗﻮ ﺯﻧﺪﮔﯽ ﮐﺮﺩﻡ ﺍﯾﻦ ﺑﻮﺩ ﮐﻪ ﺍﺯ ﺑﻘﺎﻟﯽ ﯾﻪ ﺩﻭﻧﻪ\nﻟﻮﺍﺷﮏ ﺧﺮﯾﺪﻡ\nﺭﻓﺘﻢ ﺧﻮﻧﻪ ﺩﯾﺪﻡ ﺩﻭﺗﺎﺳﺖ ﭼﺴﺒﯿﺪﻥ ﺑﻬﻢ :))", u"تو ژاپن از هرچیزی برق تولید میکنن…\n\n\nتو ایران سوسیس کالباس", u"باکتری چیست؟\n\nموجودی که با قوری نبوده است!!!", u"این روزا با این قیمت میوه ها\nتنها ویتامینی که می تونیم بگیریم\nویتامین دیه", u"همسایمون نذری آورده بود\nاومدم تشکر کنم قاطی کردم گفتم خداروشکر!!\n بیچاره فکر کرد\nما داشتیم از گشنگی میمردیم :|\nدوتا بهم داد !", u"بچه که بودم دلم میخواست زنگ بزنم به آدم خوبای فیلما\nبهشون از نقشه های آدم بدا بگم\nتا این حد مغزم کار میکرد :))", u"کتلت چیست؟\nنوعی کباب کوبیدست فقط خستس…خسته!!\nمیفهمییی؟؟؟؟داغوونه…", u"آقا ما ی پسر همسایه داریم موهاش بوره! خیییلیا!!!\nچند وقته ریش گذاشته!!!\nلامصب تا نگاش میکنم یاد پشمک زعفرونی میوفتم"]
    
    def suggest(self):
        rand = random.randint(1, len(self.db)-1)
        return  self.db[rand]
    
    
